Table of Contents
 Class ConnHiddenClientFactory
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class ConnHiddenClientFactory : IDisposable, IConnCalculatorFactory
Inheritance
object
ConnHiddenClientFactory
Implements
IDisposable
IConnCalculatorFactory
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ConnHiddenClientFactory(string)
public ConnHiddenClientFactory(string ideaInstallDir)
Parameters
ideaInstallDir string
 ConnHiddenClientFactory(string, IPluginLogger)
public ConnHiddenClientFactory(string ideaInstallDir, IPluginLogger logger)
Parameters
ideaInstallDir string
logger IPluginLogger
Methods
 Create()
public ConnectionHiddenCheckClient Create()
Returns
ConnectionHiddenCheckClient
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool disposing)
Parameters
disposing bool
 Edit this page